trade/src/Reports/СоставСегментовРетроБонусовПоставщиков/СоставСегментовРетроБонусовПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СоставСегментовРетроБонусовПоставщиков</name>
</mdclass:Report>

trade/src/InformationRegisters/РетроБонусыПоставщиковТовары/РетроБонусыПоставщиковТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыПоставщиковТовары</name>
  <resources>
    <name>БазоваяЦена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <resources>
    <name>БонусЗаЕдиницу</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБонус</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПланГраницаДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовПоставщика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>БонусПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/РетроБонусыПоставщиковУсловия/РетроБонусыПоставщиковУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РетроБонусыПоставщиковУсловия</name>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыРетроБонусовПоставщиков</types>
    </type>
  </resources>
  <resources>
    <name>ТипБонуса</name>
    <type>
      <types>EnumRef.ТипыРетроБонусовПоставщиков</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставУчастников</name>
    <type>
      <types>EnumRef.СоставыУчастниковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>Участники</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>СоставТоваров</name>
    <type>
      <types>EnumRef.СоставыТоваровРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>Товары</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БонусПроцент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБонус</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьУсловий</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретНачисленияСверхПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СегментыЗафиксированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Склады</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидШкалыРасчета</name>
    <comment>Для базы по количеству: 0 - прогрессивная шкала, 1 - по диапазонам.  Для базы по сумме: 0 - одно значение, 1 - прогрессивная шкала, 2 - по диапазонам.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторДвижения</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовПоставщика</types>
    </type>
  </attributes>
  <dimensions>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументУсловий</name>
    <type>
      <types>DocumentRef.УсловияРетроБонусовПоставщика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/СоставыТоваровРетроБонусов/СоставыТоваровРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыТоваровРетроБонусов</name>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>СегментыНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СоставыСписковРетроБонусов/СоставыСписковРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СоставыСписковРетроБонусов</name>
  <enumValues>
    <name>Все</name>
  </enumValues>
  <enumValues>
    <name>Выбранные</name>
  </enumValues>
  <enumValues>
    <name>КромеВыбранных</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СтатусыДокументовРетроБонусов/СтатусыДокументовРетроБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовРетроБонусов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/ВидыРетроБонусовПоставщиков/ВидыРетроБонусовПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРетроБонусовПоставщиков</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипБонуса</name>
    <type>
      <types>EnumRef.ТипыРетроБонусовПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВидовРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРасчета</name>
    <type>
      <types>EnumRef.БазыРасчетаРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТоваров</name>
    <type>
      <types>EnumRef.ЦелевыеПоказателиРетроБонусовПоТоварам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьУсловий</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>EnumRef.ПериодичностиРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРаспределения</name>
    <type>
      <types>EnumRef.ПорядкиРаспределенияРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставТоваров</name>
    <type>
      <types>EnumRef.СоставыТоваровРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборТоваров</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнениеУсловийПоПокупателям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставУчастников</name>
    <type>
      <types>EnumRef.СоставыУчастниковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборУчастников</name>
    <type>
      <types>EnumRef.СоставыСписковРетроБонусов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Reports/СоставСегментовРетроБонусовПоставщиков/ObjectModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// При компоновке результата.
// 
// Параметры:
//  ДокументРезультат - ТабличныйДокумент - Документ результат
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных - Данные расшифровки
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ДокументУРБ = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ДокументУРБ").Значение;  // ДокументСсылка.УсловияРетроБонусовПоставщика 
	ВариантОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ВариантОтчета").Значение;  // Строка 
	ВыводитьАртикул = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ВыводитьАртикул").Значение;  // Булево
	
	ПоДаннымДокумента = (ВариантОтчета = 2);
	
	СтруктураПараметров = ДополнительныеПараметрыПоУРБ(ДокументУРБ, ПоДаннымДокумента);
	
	СоставТоваров = СтруктураПараметров.СоставТоваров;
	СоставСегментыНоменклатуры = (СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры);
	ПроверитьСоставТоваров(СоставСегментыНоменклатуры);
	
	СтруктураПараметров.ВыводитьАртикул = ВыводитьАртикул;
	
	ОформитьЗаголовки(НастройкиОтчета, СтруктураПараметров, ПоДаннымДокумента);
	
	НаборыДанных = ИнициализироватьВнешнийНаборДанных(СтруктураПараметров, ПоДаннымДокумента);
	
	КомментарийСегментыНеЗафиксированы = НСтр("ru = 'Данные о составе сегментов не зафиксированы, могут быть изменены по правилам формирования сегментов'");
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		НастройкиОтчета,
		"КомментарийСегментыНеЗафиксированы",
		КомментарийСегментыНеЗафиксированы);
	
	КомментарийСегментыЗафиксированы = НСтр("ru = 'Расчет и начисление ретро-бонуса осуществляется по данным зафиксированного состава сегментов'");
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(
		НастройкиОтчета,
		"КомментарийСегментыЗафиксированы",
		КомментарийСегментыЗафиксированы);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ОтчетПустой = ОтчетыСервер.ОтчетПустой(ЭтотОбъект, ПроцессорКомпоновки);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - См. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.ФормироватьСразу = Истина;
	Настройки.РазрешеноИзменятьВарианты = Ложь;
	Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета:
//      * Отчет - ОтчетОбъект.РасчетРетроБонусовКлиентов
//      * Параметры - Структура:
//         ** ПараметрКоманды - ДокументСсылка.УсловияРетроБонусовПоставщика
//   Отказ - Булево - Признак отказа от создания формы.
//      См. описание одноименного параметра "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//   СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события.
//      См. описание одноименного параметра "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
// См. также:
//   Процедура для вывода добавленных команд в форму: ОтчетыСервер.ВывестиКоманду().
//   Глобальный обработчик этого события: ОтчетыПереопределяемый.ПриСозданииНаСервере().
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = Форма.Параметры;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	ПоДаннымДокумента = Ложь;
	Если НастройкиОтчета.ДополнительныеСвойства.КлючВарианта = "СоставСегментовРетроБонусовПоставщиковПоДаннымДокументаКонтекст" Тогда
		
		ПоДаннымДокумента = Истина;
		
	КонецЕсли;
	
	Если Параметры.Свойство("ПараметрКоманды") Тогда
		
		ПараметрКоманды = Параметры.ПараметрКоманды; // ДокументСсылка.УсловияРетроБонусовПоставщика
		ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
		
		Форма.НастройкиОтчета.РазрешеноВыбиратьВарианты = Ложь;
		
		Если ТипПараметраКоманды = Тип("ДокументСсылка.УсловияРетроБонусовПоставщика") Тогда
			
			СтруктураПараметров = ДополнительныеПараметрыПоУРБ(ПараметрКоманды, ПоДаннымДокумента);
			СоставТоваров = СтруктураПараметров.СоставТоваров;
			СоставСегментыНоменклатуры = (СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры);
			УРБСогласован = СтруктураПараметров.УРБСогласован;
			
			Если НЕ УРБСогласован
			   И НЕ ПоДаннымДокумента Тогда
					
				ТекстСообщения = НСтр("ru = 'Формирование отчета предусмотрено только для согласованных условий и с настройкой по сегментам товаров.'");
				ВызватьИсключение ТекстСообщения;
					
			ИначеЕсли НЕ СоставСегментыНоменклатуры Тогда
				
				ПроверитьСоставТоваров(СоставСегментыНоменклатуры);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Параметры.ПредставлениеВарианта) Тогда
		
		Отказ = Истина;
		СинонимДокумента = Метаданные.Документы.УсловияРетроБонусовПоставщика.Синоним;
		ШаблонОшибки = НСтр("ru= 'Отчет предназначен только для открытия из документа ""%1"".'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, СинонимДокумента);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - См. ОбщаяФорма.ФормаОтчета
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться, если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено, когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда пользовательские настройки не надо загружать (уже загружены ранее).
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы = КлючВарианта Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыеНастройкиКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Параметры = Контекст.Параметры;
		Если Параметры.Свойство("ПараметрКоманды") Тогда
			
			ПараметрКоманды = Параметры.ПараметрКоманды; // ДокументСсылка.УсловияРетроБонусовПоставщика
			ЗаполнитьПараметрыПоКонтексту(ПараметрКоманды, НовыеНастройкиКД);
			
		КонецЕсли;
		
	КонецЕсли;
	
	КлючСхемы = КлючВарианта;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСоставТоваров(СоставСегментыНоменклатуры)
	
	Если НЕ СоставСегментыНоменклатуры Тогда
		
		ТекстСообщения = НСтр("ru = 'Формирование отчета предусмотрено только для документов с настройкой по сегментам товаров.'");
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОформитьЗаголовки(НастройкиОтчета, СтруктураПараметров, ПоДаннымДокумента)
	
	СегментыЗафиксированы = СтруктураПараметров.СегментыЗафиксированы;
	Товары = СтруктураПараметров.Товары;
	ВыводитьАртикул = СтруктураПараметров.ВыводитьАртикул;
	
	Если ПоДаннымДокумента Тогда
		ПредставлениеДокумента = СтруктураПараметров.ДокументУРБПредставление;
	Иначе
		ПредставлениеДокумента = СтруктураПараметров.ДокументУРБПервичныйПредставление;
	КонецЕсли;
		
	ШаблонЗаголовка = НСтр("ru = 'Состав сегментов документа %1'");
	ЗаголовокОтчета = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, ПредставлениеДокумента);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметрВывода(НастройкиОтчета, "Заголовок", ЗаголовокОтчета);
	
	Для Каждого ЭлементСтруктуры Из НастройкиОтчета.Структура Цикл
		
		Если ЭлементСтруктуры.Имя = "Товары" Тогда
			
			Если Товары = Перечисления.СоставыСписковРетроБонусов.Выбранные Тогда
				
				ЗаголовокГруппировки = НСтр("ru = 'Выбранные товары'");
				
			Иначе
				
				ЗаголовокГруппировки = НСтр("ru = 'Все кроме выбранных товаров'");
				
			КонецЕсли;
			КомпоновкаДанныхКлиентСервер.УстановитьПараметрВывода(ЭлементСтруктуры, "Заголовок", ЗаголовокГруппировки);
			
			ПолеКомпоновки = Новый ПолеКомпоновкиДанных("Артикул");
			
			Для Каждого ПолеГруппировки Из ЭлементСтруктуры.ПоляГруппировки.Элементы Цикл
			
				Если ТипЗнч(ПолеГруппировки) = Тип("ПолеГруппировкиКомпоновкиДанных")
				   И ПолеГруппировки.Поле = ПолеКомпоновки Тогда
					
					ПолеГруппировки.Использование = ВыводитьАртикул;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
				
		ИначеЕсли ЭлементСтруктуры.Имя = "КомментарийСегментыНеЗафиксированы" Тогда
			
			ИспользоватьГруппировку = (НЕ СегментыЗафиксированы И НЕ ПоДаннымДокумента);
			ЭлементСтруктуры.Использование = ИспользоватьГруппировку; 
			
		ИначеЕсли ЭлементСтруктуры.Имя = "КомментарийСегментыЗафиксированы" Тогда
			
			ИспользоватьГруппировку = (СегментыЗафиксированы И НЕ ПоДаннымДокумента);
			ЭлементСтруктуры.Использование = ИспользоватьГруппировку;
			
		ИначеЕсли ЭлементСтруктуры.Имя = "КомментарийПустой" Тогда
			
			ЭлементСтруктуры.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет параметры из переданного контекста.
// 
// Параметры:
//  ПараметрКоманды - ЛюбаяСсылка
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//
Процедура ЗаполнитьПараметрыПоКонтексту(ПараметрКоманды, НовыеНастройкиКД)
	
	ТипПараметраКоманды = ТипЗнч(ПараметрКоманды);
	
	Если ТипПараметраКоманды = Тип("ДокументСсылка.УсловияРетроБонусовПоставщика") Тогда
		
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ДокументУРБ", ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИнициализироватьВнешнийНаборДанных(СтруктураПараметров, ПоДаннымДокумента)
	
	НаборДанныхТовары = Новый ТаблицаЗначений;
	НаборДанныхТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НаборДанныхТовары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	НаборДанных = Новый Структура;
	НаборДанных.Вставить("НаборДанныхТовары", НаборДанныхТовары);
	
	ДокументУРБ = СтруктураПараметров.ДокументУРБ;
	ДокументУРБПервичный = СтруктураПараметров.ДокументУРБПервичный;
	СоставТоваров = СтруктураПараметров.СоставТоваров;
	СегментыЗафиксированы = СтруктураПараметров.СегментыЗафиксированы;
	
	СоставСегментыНоменклатуры = (СоставТоваров = Перечисления.СоставыТоваровРетроБонусов.СегментыНоменклатуры);
	
	Если СоставСегментыНоменклатуры Тогда
	
		Если СегментыЗафиксированы
		   И НЕ ПоДаннымДокумента Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДокументУсловий", ДокументУРБПервичный);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РетроБонусыПоставщиковТовары.Номенклатура КАК Номенклатура,
			|	РетроБонусыПоставщиковТовары.Характеристика КАК Характеристика
			|ИЗ
			|	РегистрСведений.РетроБонусыПоставщиковТовары КАК РетроБонусыПоставщиковТовары
			|ГДЕ
			|	РетроБонусыПоставщиковТовары.ДокументУсловий = &ДокументУсловий"; 
			
			Результат = Запрос.Выполнить();
			НаборДанных.НаборДанныхТовары = Результат.Выгрузить();
			
		Иначе 
			
			Если ПоДаннымДокумента Тогда
				
				НаборДанных.НаборДанныхТовары = РетроБонусыСервер.ЗаполнитьДанныеДляФиксацииСегментовТоваров(
					ДокументУРБ, 
					ПоДаннымДокумента);
					
			Иначе
				
				НаборДанных.НаборДанныхТовары = РетроБонусыСервер.ЗаполнитьДанныеДляФиксацииСегментовТоваров(
					ДокументУРБПервичный);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НаборДанных;
	
КонецФункции

Функция ДополнительныеПараметрыПоУРБ(ДокументУРБ, ПоДаннымДокумента = Ложь)
	
	СтруктураПараметров = СтруктураПараметровОтчета();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументУсловий", ДокументУРБ);
	Запрос.УстановитьПараметр("ПоДаннымДокумента", ПоДаннымДокумента);
	
	Если ПоДаннымДокумента Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеУсловий.ОтборТоваров КАК Товары,
		|	ЕСТЬNULL(ВидыРетроБонусовПоставщиков.СоставТоваров,
		|		ЗНАЧЕНИЕ(Перечисление.СоставыТоваровРетроБонусов.ПустаяСсылка)) КАК СоставТоваров,
		|	ЛОЖЬ КАК СегментыЗафиксированы,
		|	ДанныеУсловий.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовРетроБонусов.Согласован) КАК УРБСогласован,
		|	ВЫБОР
		|		КОГДА ДанныеУсловий.Исправление
		|			ТОГДА ДанныеУсловий.ИсправляемыйДокумент
		|		ИНАЧЕ ДанныеУсловий.Ссылка
		|	КОНЕЦ КАК ДокументУРБПервичный,
		|	ДанныеУсловий.Представление КАК ДокументУРБПредставление,
		|	ВЫБОР
		|		КОГДА ДанныеУсловий.Исправление
		|			ТОГДА ДанныеУсловий.ИсправляемыйДокумент.Представление
		|		ИНАЧЕ ДанныеУсловий.Представление
		|	КОНЕЦ КАК ДокументУРБПервичныйПредставление
		|ИЗ
		|	Документ.УсловияРетроБонусовПоставщика КАК ДанныеУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРетроБонусовПоставщиков КАК ВидыРетроБонусовПоставщиков
		|		ПО ДанныеУсловий.ВидРетроБонуса = ВидыРетроБонусовПоставщиков.Ссылка
		|ГДЕ
		|	ДанныеУсловий.Ссылка = &ДокументУсловий";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.Товары, ЗНАЧЕНИЕ(Перечисление.СоставыСписковРетроБонусов.ПустаяСсылка)) КАК Товары,
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.СоставТоваров, ЗНАЧЕНИЕ(Перечисление.СоставыТоваровРетроБонусов.ПустаяСсылка)) КАК СоставТоваров,
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.СегментыЗафиксированы, ЛОЖЬ) КАК СегментыЗафиксированы,
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.ДокументУсловий, ЛОЖЬ) <> ЛОЖЬ КАК УРБСогласован,
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.ДокументУсловий, ЗНАЧЕНИЕ(Документ.УсловияРетроБонусовПоставщика.ПустаяСсылка)) КАК ДокументУРБПервичный,
		|	ДанныеУсловий.Представление КАК ДокументУРБПредставление,
		|	ВЫБОР
		|		КОГДА НЕ РетроБонусыПоставщиковУсловия.ДокументУсловий ЕСТЬ NULL
		|			ТОГДА РетроБонусыПоставщиковУсловия.ДокументУсловий.Представление
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументУРБПервичныйПредставление
		|ИЗ
		|	Документ.УсловияРетроБонусовПоставщика КАК ДанныеУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РетроБонусыПоставщиковУсловия КАК РетроБонусыПоставщиковУсловия
		|		ПО ДанныеУсловий.ИсправляемыйДокумент = РетроБонусыПоставщиковУсловия.ДокументУсловий
		|		И ДанныеУсловий.Исправление
		|ГДЕ
		|	ДанныеУсловий.Ссылка = &ДокументУсловий
		|	И НЕ РетроБонусыПоставщиковУсловия.ДокументУсловий ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.Товары, ЗНАЧЕНИЕ(Перечисление.СоставыСписковРетроБонусов.ПустаяСсылка)),
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.СоставТоваров, ЗНАЧЕНИЕ(Перечисление.СоставыТоваровРетроБонусов.ПустаяСсылка)),
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.СегментыЗафиксированы, ЛОЖЬ),
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.ДокументУсловий, ЛОЖЬ) <> ЛОЖЬ,
		|	ЕСТЬNULL(РетроБонусыПоставщиковУсловия.ДокументУсловий, ЗНАЧЕНИЕ(Документ.УсловияРетроБонусовПоставщика.ПустаяСсылка)),
		|	ДанныеУсловий.Представление,
		|	ВЫБОР
		|		КОГДА НЕ РетроБонусыПоставщиковУсловия.ДокументУсловий ЕСТЬ NULL
		|			ТОГДА РетроБонусыПоставщиковУсловия.ДокументУсловий.Представление
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	Документ.УсловияРетроБонусовПоставщика КАК ДанныеУсловий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РетроБонусыПоставщиковУсловия КАК РетроБонусыПоставщиковУсловия
		|		ПО ДанныеУсловий.Ссылка = РетроБонусыПоставщиковУсловия.ДокументУсловий
		|		И НЕ ДанныеУсловий.Исправление
		|ГДЕ
		|	ДанныеУсловий.Ссылка = &ДокументУсловий
		|	И НЕ РетроБонусыПоставщиковУсловия.ДокументУсловий ЕСТЬ NULL";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
		
	КонецЕсли;
	
	СтруктураПараметров.ДокументУРБ = ДокументУРБ;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция СтруктураПараметровОтчета()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументУРБ", Документы.УсловияРетроБонусовПоставщика.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДокументУРБПервичный", Документы.УсловияРетроБонусовПоставщика.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДокументУРБПредставление", "");
	СтруктураПараметров.Вставить("ДокументУРБПервичныйПредставление", "");
	СтруктураПараметров.Вставить("СоставТоваров", Перечисления.СоставыТоваровРетроБонусов.ПустаяСсылка());
	СтруктураПараметров.Вставить("Товары", Перечисления.СоставыСписковРетроБонусов.ПустаяСсылка());
	СтруктураПараметров.Вставить("СегментыЗафиксированы", Ложь);
	СтруктураПараметров.Вставить("УРБСогласован", Ложь);
	СтруктураПараметров.Вставить("ВыводитьАртикул", Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#КонецЕсли
